Merge pull request #19 from Elemento-X/feat/Maclean
new feat
